HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPort_regdef.h
/** \\brief  Port Input Register */
typedef struct _Ifx_P_IN_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Port n Input Bit 0 (rh) */
    unsigned int P1:1;                      /**< \brief [1:1] Port n Input Bit 1 (rh) */
    unsigned int P2:1;                      /**< \brief [2:2] Port n Input Bit 2 (rh) */
    unsigned int P3:1;                      /**< \brief [3:3] Port n Input Bit 3 (rh) */
    unsigned int P4:1;                      /**< \brief [4:4] Port n Input Bit 4 (rh) */
    unsigned int P5:1;                      /**< \brief [5:5] Port n Input Bit 5 (rh) */
    unsigned int P6:1;                      /**< \brief [6:6] Port n Input Bit 6 (rh) */
    unsigned int P7:1;                      /**< \brief [7:7] Port n Input Bit 7 (rh) */
    unsigned int P8:1;                      /**< \brief [8:8] Port n Input Bit 8 (rh) */
    unsigned int P9:1;                      /**< \brief [9:9] Port n Input Bit 9 (rh) */
    unsigned int P10:1;                     /**< \brief [10:10] Port n Input Bit 10 (rh) */
    unsigned int P11:1;                     /**< \brief [11:11] Port n Input Bit 11 (rh) */
    unsigned int P12:1;                     /**< \brief [12:12] Port n Input Bit 12 (rh) */
    unsigned int P13:1;                     /**< \brief [13:13] Port n Input Bit 13 (rh) */
    unsigned int P14:1;                     /**< \brief [14:14] Port n Input Bit 14 (rh) */
    unsigned int P15:1;                     /**< \brief [15:15] Port n Input Bit 15 (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_IN_Bits;

/** \\brief  Port Input/Output Control Register 0 */
typedef struct _Ifx_P_IOCR0_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC0:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC1:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC2:5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC3:5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR0_Bits;

/** \\brief  Port Input/Output Control Register 12 */
typedef struct _Ifx_P_IOCR12_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC12:5;                    /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC13:5;                    /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC14:5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC15:5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR12_Bits;

/** \\brief  Port Input/Output Control Register 4 */
typedef struct _Ifx_P_IOCR4_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC4:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC5:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC6:5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC7:5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR4_Bits;

/** \\brief  Port Input/Output Control Register 8 */
typedef struct _Ifx_P_IOCR8_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC8:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC9:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC10:5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC11:5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR8_Bits;

/** \\brief  Port LVDS Pad Control Register 0 */
typedef struct _Ifx_P_LPCR0_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int PS1:1;                     /**< \brief [1:1] Pad Supply for pins [1:0] (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_P_LPCR0_Bits;

/** \\brief  Port LVDS Pad Control Register 1 */
typedef struct _Ifx_P_LPCR1_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int PS1:1;                     /**< \brief [1:1] Pad Supply for pins [3:2] (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_P_LPCR1_Bits;

/** \\brief  Port LVDS Pad Control Register 1 */
typedef struct _Ifx_P_LPCR1_P21_Bits
{
    unsigned int RDIS_CTRL:1;               /**< \brief [0:0] LVDS RX_DIS controller (rw) */
    unsigned int RX_DIS:1;                  /**< \brief [1:1] Disable Receive LVDS (rw) */
    unsigned int TERM:1;                    /**< \brief [2:2] Select Receiver Termination Mode (rw) */
    unsigned int LRXTERM:5;                 /**< \brief [7:3] LVDS RX Poly-resistor configuration value (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_P_LPCR1_P21_Bits;

/** \\brief  Port LVDS Pad Control Register 2 */
typedef struct _Ifx_P_LPCR2_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int LVDSR:1;                   /**< \brief [8:8] Special reduced LVDS electrical signaling mode (rw) */
    unsigned int LVDSRL:1;                  /**< \brief [9:9] LVDS IEEE electrical signaling mode (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int TDIS_CTRL:1;               /**< \brief [12:12] LVDS TX_DIS controller (rw) */
    unsigned int TX_DIS:1;                  /**< \brief [13:13] Disable Transmit LVDS (rw) */
    unsigned int TX_PD:1;                   /**< \brief [14:14] LVDS Power Down (rw) */
    unsigned int TX_PWDPD:1;                /**< \brief [15:15] Disable TX Power down pull down. (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_LPCR2_Bits;

